//TIP To <b>Run</b> code, press <shortcut actionId="Run"/> or
// click the <icon src="AllIcons.Actions.Execute"/> icon in the gutter.
public class Main {
    public static void main(String[] args) {
        public static int[] concat(int[] one; int[] two){
           int [] three;


            return ;
        }

        //Есть 2 массива
         int[] arr1 = {-2,-1,0,4,7,10,12};
         int[] arr2 = {-10,1,1,1,2,3,6,7,10,100,1000};
        // Написать метод который принимает 2 массива и возвращает
        // 3тий массив в таком виде чтобы данный массив был выстроен от
        // меньшего до большего  for можно не использовать   вроде как
        //   сортировку не использовать
        int[] arr3 = concat();
         for (int i = 0; i < arr3.length; i++) {
         System.out.print(arr3[i] + " ");
         }
        // -10,-2,-1,1,1,1,0,2,3,4,6,7,7,10,10,12,100,1000

    }
}
