//TIP To <b>Run</b> code, press <shortcut actionId="Run"/> or
// click the <icon src="AllIcons.Actions.Execute"/> icon in the gutter.
public class Main {
    public static void main(String[] args) {
//1) Напишите лямбда-выражение, которое принимает два целых числа и возвращает их сумму.
//2) Создайте лямбда-выражение, которое проверяет, является ли строка пустой.
//3) Напишите лямбда-выражение, которое принимает строку и возвращает её длину.
//4) Создайте лямбда-выражение, которое возвращает максимальное из двух чисел.
//5) Напишите лямбда-выражение для проверки, является ли число четным.
//6) Напишите лямбда-выражение, которое возводит число в квадрат.
//7) Создайте лямбда-выражение, которое выводит на экран строку.
//8) Напишите лямбда-выражение, которое принимает строку и возвращает её в верхнем регистре.
//9) Напишите лямбда-выражение, которое проверяет, содержит ли строка подстроку.
//10) Напишите лямбда-выражение, которое преобразует строку в число.
//11) Создайте лямбда-выражение, которое умножает два числа и возвращает результат.
//12) Напишите лямбда-выражение, которое проверяет, является ли число положительным.
//13) Напишите лямбда-выражение для фильтрации всех чётных чисел из списка.
//14) Напишите лямбда-выражение, которое находит наибольший элемент в списке чисел.
//15) Напишите лямбда-выражение, которое сортирует список строк по длине.
//16) Создайте лямбда-выражение, которое возвращает строку без пробелов в начале и в конце.
//17) Напишите лямбда-выражение, которое объединяет два списка в один.
//18) Напишите лямбда-выражение, которое возвращает строку с первой буквой в верхнем регистре.
//19) Напишите лямбда-выражение, которое находит разницу между двумя датами.
//20) Напишите лямбда-выражение, которое проверяет, является ли строка числом.
    }
}
