import java.util.Random;

//TIP To <b>Run</b> code, press <shortcut actionId="Run"/> or
// click the <icon src="AllIcons.Actions.Execute"/> icon in the gutter.
public class Main {
    public static void main(String[] args) {
//        1) Создайте массив из 10 целых чисел и заполните его числами от 1 до 10. Выведите массив на экран.
//        int []arr = new int []{1,2,3,4,5,6,7,8,9,10};
//        for (int i = 0; i < arr.length; i++) {
//            System.out.print(arr[i] + " ");
//        }
//        //2) Найдите сумму элементов массива. Создайте массив из 5 элементов и вычислите сумму всех чисел в массиве.
////       int []arr = new int[] {10,20,30,40,50};
////        int sum = 0;
////        for (int i = 0; i < arr.length; i++) {
////               sum=sum+arr[i];
////        }
////        System.out.println(sum);
//
//// 3) Найдите максимальный элемент массива. Создайте массив из 10 целых чисел и найдите максимальное значение.
//// int arr[] = new int []{1,2,3,4,5,6,7,8,9,10};
//// int max = arr[0];
////        for (int i = 0; i < arr.length; i++) {
////            if (arr[i]>max);
////            max = arr[i];
////        }
////        System.out.println(max);
//
//// 4) Найдите минимальный элемент массива. Создайте массив из 10 целых чисел и найдите минимальное значение.
//// int arr[] = new int []{1,2,3,4,5,6,7,8,9,10};
//// int min = arr[0];
//// for (int i = 0; i < arr.length; i++) {
////   if (arr[i] <= min)
////      min = arr[i];
////        }
//// System.out.println(min);
//        5) Посчитайте количество чётных чисел в массиве.
//        int []arr = new int []{1,2,3,4,5,6,7,8,9,10};
//        int x = 0;
//        for (int i = 0; i < arr.length; i++) {
//            if (arr[i]%2==0)
//                x++;
//        }
//        System.out.println(x);

//        6) Посчитайте количество нечётных чисел в массиве.
//        int []arr = new int []{1,2,3,4,5,6,7,8,9,10};
//        int x = 0;
//        for (int i = 0; i < arr.length; i++) {
//            if (arr[i]%2!=0)
//                x++;
//        }
//        System.out.println(x);
//        7) Посчитайте среднее арифметическое всех элементов массива.
        //int arr[] = new int []{1,2,3,4,5};
//int x = 0;
//int sum = 0;
//for (int i = 0; i < arr.length; i++) {
// sum  = sum + arr[i];
// x = sum/ arr.length;
//}
//System.out.println(x);

//        8) Выведите все элементы массива в обратном порядке.
//int []arr = new int []{1,2,3,4,5,6,7,8,9,10};
//for (int i = 9; i < arr.length; i--) {
//System.out.print(arr[i] + " ");
//}

//        9) Заполните массив случайными числами от 1 до 100 и выведите его на экран.
//        int []arr = new int [15];
//        Random ran = new Random();
//        for (int i = 0; i < arr.length; i++) {
//            arr[i] = ran.nextInt(100);
//            System.out.print(arr[i] + " ");
//        }



//        10)Поменяйте местами первый и последний элементы массива.
//        int[] arr = new int[]{1, 2, 3, 4, 5, 6, 7, 8, 9, 10};
// int a = arr[0];
// arr[0] = arr[9];
// arr[9] = a;
// for (int i = 0; i < arr.length; i++) {
//  System.out.print(arr[i] + " ");
//}
// 11)Найдите разницу между максимальным и минимальным элементами массива.
//int []arr = new int []{1,2,3,4,5,6,7,8,9,10};
//int max = arr[0];
//int min = arr[0];
//int x = 0;
//for (int i = 0; i < arr.length; i++) {
//    if (arr[i] > max) ;
//    max = arr[i];
//}
//for (int i = 0; i < arr.length; i++) {
//if (arr[i]>max);
//max = arr[i];
//}
//x = max + min;
//System.out.println(x);

// 12)Посчитайте количество элементов, больше среднего арифметического.
//int arr[] = new int []{1,2,3,4,5};
//int x = 0;
//int sum = 0;
//int a = 0;
//for (int i = 0; i < arr.length; i++) {
//    sum = sum + arr[i];
//    x = sum / arr.length;
//}
//    for (int i = 0; i < arr.length; i++) {
//        if (arr[i]>x)
//            a++;
//    }
//
//System.out.println(a);

// 13)Создайте массив и заполните его квадратами чисел от 1 до 10.
//        int arr[] = new int[]{1,2,3,4,5,6,7,8,9,10};
//        for (int i = 0; i < arr.length; i++) {
//           arr[i]=arr[i]*arr[i];
//            System.out.print(arr[i] + " ");
//        }

}
}
